# Д/З № 4

In [10]:
import sqlite3
import pandas as pd

In [12]:
con = sqlite3.connect('DZ.db')

In [13]:
cur = con.cursor()

In [15]:
cur.execute('SELECT * FROM EmployeePoints').fetchall()

[('Маша', 5, '2020-01-01'),
 ('Петя', 4, '2020-01-01'),
 ('Вася', 3, '2020-01-01'),
 ('Саша', 4, '2020-01-01'),
 ('Маша', 4, '2020-01-02'),
 ('Петя', 4, '2020-01-02'),
 ('Вася', 4, '2020-01-02'),
 ('Саша', 5, '2020-01-02'),
 ('Маша', 5, '2020-01-03'),
 ('Петя', 3, '2020-01-03'),
 ('Вася', 2, '2020-01-03'),
 ('Саша', 5, '2020-01-03'),
 ('Маша', 3, '2020-01-04'),
 ('Петя', 3, '2020-01-04'),
 ('Вася', 3, '2020-01-04'),
 ('Саша', 3, '2020-01-04'),
 ('Максим', 2, '2020-01-04'),
 ('Маша', 5, '2020-01-05'),
 ('Петя', 3, '2020-01-05'),
 ('Вася', 3, '2020-01-05'),
 ('Саша', 3, '2020-01-05')]

#Напишите SELECT, который выводит список уникальных имен сотрудников.

In [18]:
df = pd.read_sql("""

  select distinct Employee from EmployeePoints
Group by Employee

""", con)

In [19]:
df

  Employee
0     Вася
1   Максим
2     Маша
3     Петя
4     Саша

In [ ]:
#Напишите SELECT, который выводит список сотрудников, упорядоченный по количеству полученных оценок "5", начиная с сотрудника, который получил их максимальное количество

In [26]:
df = pd.read_sql("""

  select Employee, count (Point) as '# of 5'
from EmployeePoints
Where Point = 5
group by 1
order by '# of 5'

""", con)

In [27]:
df

  Employee  # of 5
0     Маша       6
1     Саша       4

In [ ]:
# ?? Почему-то задвоен рез-т в столбце '# of 5' - в таблице DB browser в этом столбце значения 3 и 2.

In [ ]:
#The End